SampleMessages/Adastra/RequestAmbulanceDispatch-v2-0_20121017140533_9565A7FD-E896-44B4-945E-DA5C72635FA3.log

POST /syncsoap HTTP/1.1
Expect: 100-continue
Content-Type: text/xml; charset=utf-8
Connection: Keep-Alive
Host: test01.oneoneone.nhs.uk:4848
SOAPAction: "urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0"
Content-Length: 10443

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0</a:Action><a:MessageID>9565A7FD-E896-44B4-945E-DA5C72635FA3</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">https://test01.oneoneone.nhs.uk:4848/syncsoap</a:To></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><DistributionEnvelope xmlns="urn:nhs-itk:ns:201005"><header service="urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0" trackingid="E5278E61-BC5A-430A-AD54-D2845060D7B5"><addresslist><address uri="urn:nhs-uk:addressing:ods:RYD"/></addresslist><auditIdentity><id uri="urn:nhs-uk:identity:ods:ADVHC"/></auditIdentity><manifest count="1"><manifestitem id="uuid_ce0d870b-a6b4-49ca-b7b5-c287a1f9a042" mimetype="text/xml" profileid="urn:nhs-en:profile:nhs111AmbulanceRequest-v1-0"/></manifest><senderAddress uri="urn:nhs-uk:addressing:ods:ADVHC"/><handlingSpecification><spec key="urn:nhs-itk:ns:201005:interaction" value="urn:nhs-itk:interaction:primaryNHS111RequestforAmbulance-v2-0"/></handlingSpecification></header><payloads count="1"><payload id="uuid_ce0d870b-a6b4-49ca-b7b5-c287a1f9a042"><AmbulanceRequest classCode="PCPR" moodCode="RQO" xmlns="urn:hl7-org:v3" xmlns:npfitlc="NPFIT:HL7:Localisation"><code code="828791000000100" codeSystem="2.16.840.1.113883.2.1.3.2.4.15"/><effectiveTime value="20121017140057+01"/><id root="CE0D870B-A6B4-49CA-B7B5-C287A1F9A042"/><author typeCode="AUT" contextControlCode="OP"><npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145200GB01#AssignedAuthor"/><functionCode code="OA" displayName="Originating Author" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.178"/><time value="20121017140057+01"/><COCD_TP145200GB01.AssignedAuthor classCode="ASSIGNED"><code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.339" code="DOCTOR" displayName="Doctor"/><id extension="DE1035C2-AC25-4362-A21F-3D64CF6F0D1E" root="2.16.840.1.113883.2.1.3.2.4.18.24" assigningAuthorityName="ADVHC:Advanced Health and Care"/><id nullFlavor="UNK"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#AssignedAuthor"/><assignedPerson classCode="PSN" determinerCode="INSTANCE"><name><given>Mike</given><family>Bower</family></name><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#assignedPerson"/></assignedPerson><representedOrganization classCode="ORG" determinerCode="INSTANCE"><id extension="GYTB 12345" root="2.16.840.1.113883.2.1.3.2.4.19.1"/><name>Cambridge Base (Advanced Health and Care)</name><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#representedOrganization"/></representedOrganization></COCD_TP145200GB01.AssignedAuthor></author><informationRecipient typeCode="PRCP"><npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145203GB03#IntendedRecipient"/><COCD_TP145203GB03.IntendedRecipient classCode="ASSIGNED"><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145203GB03#IntendedRecipient"/><representedOrganization classCode="ORG" determinerCode="INSTANCE"><id extension="RYD" root="2.16.840.1.113883.2.1.3.2.4.19.2"/><name>South East Coast Ambulance Service (SECAMB)</name><standardIndustryClassCode code="018" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.191" displayName="Ambulance Trust"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145203GB03#representedOrganization"/></representedOrganization></COCD_TP145203GB03.IntendedRecipient></informationRecipient><pertinentInformation typeCode="PERT"><seperatableInd value="false"/><pertinentTraumaFlag classCode="OBS" moodCode="EVN"><code code="TM" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327"/><value value="true"/></pertinentTraumaFlag></pertinentInformation><pertinentInformation1 typeCode="PERT"><seperatableInd value="false"/><pertinentFireFlag classCode="OBS" moodCode="EVN"><code code="FR" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327"/><value value="false"/></pertinentFireFlag></pertinentInformation1><pertinentInformation2 typeCode="PERT"><seperatableInd value="false"/><pertinentSceneSafeFlag classCode="OBS" moodCode="EVN"><code code="SC" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327"/><value nullFlavor="UNK"/></pertinentSceneSafeFlag></pertinentInformation2><pertinentInformation3 typeCode="PERT"><seperatableInd value="false"/><pertinentPoliceFlag classCode="OBS" moodCode="EVN"><code code="PL" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327"/><value value="false"/></pertinentPoliceFlag></pertinentInformation3><pertinentInformation4 typeCode="PERT"><seperatableInd value="false"/><pertinentTrappedFlag classCode="OBS" moodCode="EVN"><code code="TR" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327"/><value value="false"/></pertinentTrappedFlag></pertinentInformation4><pertinentInformation5 typeCode="PERT"><seperatableInd value="false"/><pertinentEncounterEvent classCode="ENC" moodCode="EVN"><effectiveTime><low value="20121017135548+01"/></effectiveTime><id extension="9E052A06-B4FE-4726-9F97-1F328AB2B3A7" root="2.16.840.1.113883.2.1.3.2.4.18.34" assigningAuthorityName="ADVHC:Advanced Health and Care"/><id extension="17760" root="2.16.840.1.113883.2.1.3.2.4.18.35" assigningAuthorityName="ADVHC:Advanced Health and Care"/><text mediaType="text/plain">Symptoms: Testcase 2.4&#xD;
&#xD;
&#xD;
An injury or health problem was the reason for the contact.&#xD;
&#xD;
&#xD;
Heavy bleeding had occurred in the previous 30 minutes.&#xD;
&#xD;
The loss was 2 mugfuls of blood or more.&#xD;
The bleeding was from a wound.&#xD;
There was blood spurting or spraying from a wound.&#xD;
&#xD;
Instructions given were: An ambulance is being dispatched to arrive within 8 minutes.&#xD;
</text><informant typeCode="INF" contextControlCode="OP"><npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145007UK03#RelatedEntity"/><COCD_TP145007UK03.RelatedEntity classCode="PRS"><code code="21" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.45" displayName="Self"/><telecom value="tel:01233722700" use="EC"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145007UK03#RelatedEntity"/><relationshipHolder classCode="PSN" determinerCode="INSTANCE"><name>Matthew Stibbs (Patient)</name><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145007UK03#relationshipHolder"/></relationshipHolder></COCD_TP145007UK03.RelatedEntity></informant><location typeCode="LOC"><npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145222GB02#HealthCareFacility"/><COCD_TP145222GB02.HealthCareFacility classCode="ISDLOC"><id nullFlavor="NA"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145222GB02#HealthCareFacility"/><location classCode="PLC" determinerCode="INSTANCE"><addr use="H"><streetAddressLine>Adastra Software</streetAddressLine><streetAddressLine>Unit 4</streetAddressLine><streetAddressLine>Eurogate Business Park</streetAddressLine><postalCode>TN24 8SB</postalCode></addr><name nullFlavor="NI"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145222GB02#location"/></location></COCD_TP145222GB02.HealthCareFacility></location><recordTarget typeCode="RCT" contextControlCode="OP"><npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145201GB01#PatientRole"/><COCD_TP145201GB01.PatientRole classCode="PAT"><addr use="H"><streetAddressLine>Adastra Software</streetAddressLine><streetAddressLine>Unit 4</streetAddressLine><streetAddressLine>Eurogate Business Park</streetAddressLine><postalCode>TN24 8SB</postalCode></addr><id extension="1111111111" root="2.16.840.1.113883.2.1.3.2.4.18.23"/><id extension="AA7B002C-A6E6-4E36-8DF6-2FC2F99F4068" root="2.16.840.1.113883.2.1.3.2.4.18.24" assigningAuthorityName="ADVHC:Advanced Health and Care"/><telecom value="tel:01233722700" use="H"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145201GB01#PatientRole"/><patientPatient classCode="PSN" determinerCode="INSTANCE"><administrativeGenderCode codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25" displayName="Male" code="1"/><birthTime value="19840724"/><name><given>Matthew</given><family>Stibbs</family></name><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145201GB01#patientPatient"/></patientPatient><providerOrganization classCode="ORG" determinerCode="INSTANCE"><addr use="WP"><streetAddressLine>Clarence House</streetAddressLine><streetAddressLine>CAMBRIDGE</streetAddressLine><postalCode>CB2 2EE</postalCode></addr><id extension="1001" root="2.16.840.1.113883.2.1.3.2.4.19.1"/><name>University Health Centre</name><standardIndustryClassCode code="001" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.289" displayName="GP Practice"/><telecom value="tel:01223552856" use="WP"/><templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145201GB01#providerOrganization"/></providerOrganization></COCD_TP145201GB01.PatientRole></recordTarget></pertinentEncounterEvent></pertinentInformation5><pertinentInformation6 typeCode="PERT"><seperatableInd value="false"/><pertinentTriageDisposition classCode="OBS" moodCode="EVN"><code code="TD" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.419"/><value codeSystem="2.16.840.1.113883.2.1.3.2.4.17.414" code="Dx011" displayName="An ambulance is being dispatched to arrive within 8 minutes"/></pertinentTriageDisposition></pertinentInformation6><pertinentInformation7 typeCode="PERT"><seperatableInd value="false"/><pertinentAdditionalNotes classCode="OBS" moodCode="EVN"><code code="PRC" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.422"/><text>Testcase 2.4</text></pertinentAdditionalNotes></pertinentInformation7><reason typeCode="RSON"><seperatableInd value="false"/><justifyingTriageOutcome classCode="OBS" moodCode="EVN"><code code="TO" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.328"/><value codeSystem="2.16.840.1.113883.2.1.3.2.4.17.329" code="R2"/></justifyingTriageOutcome></reason><replacementOf typeCode="RPLC"><priorPreviousAmbulanceRequest classCode="PCPR" moodCode="RQO"><id root="25A1FF71-2DB2-4FE8-A078-152569B401C6"/></priorPreviousAmbulanceRequest></replacementOf></AmbulanceRequest></payload></payloads></DistributionEnvelope></s:Body></s:Envelope>
************ END OF INBOUND MESSAGE **************


****
<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
	<soap:Header>
		<wsa:MessageID>55D418D7-185B-11E2-938A-59C4957E920C</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0Response</wsa:Action>
	</soap:Header>
	<soap:Body><itk:SimpleMessageResponse xmlns:itk="urn:nhs-itk:ns:201005">TEST_HARNESS_ID:E5278E61-BC5A-430A-AD54-D2845060D7B5</itk:SimpleMessageResponse>
</soap:Body>
</soap:Envelope>
